#include "HWRK/is_url.h"
#include "HWRK/utils.h"

/* Вариант #67
Составить программу построчной фильтрации текста, вводимого пользователем.
Суть фильтра — отбор строк, содержащих URL-адреса. Фильтр должен быть реализован как функция,
принимающая на вход указатель на вектор строк, их количество и указатель на результирующую структуру.
На выход функция должна возвращать количество строк в результирующей структуре. Результат обработки выводится на экран. */

int main(int argc, char *argv[]) {
    init(stdin);
    return 0;
}

